In [1]:
#PANDAS Data Frames
import pandas as pd

#to generate random numbers
from numpy.random import randn

In [2]:
#create data frame size 5*5 containing random numbers
df = pd.DataFrame(randn(5,5),index=['ID1','ID2','ID3','ID4','ID5'],columns=['A1','A2','A3','A4','A5'])
df

           A1        A2        A3        A4        A5
ID1 -0.090358  0.570294  0.562648 -0.212779  0.688481
ID2  0.175455 -1.690947 -0.316585  0.080709  0.397243
ID3  0.480168  0.547512  0.897827 -0.630202  1.451062
ID4  0.324770 -1.224216  0.525886  1.161081  1.311399
ID5  0.279116  1.434256 -1.241946  0.062798 -0.801436

# Join two data frames

In [3]:
df2= pd.DataFrame(randn(3,3),index=['ID1','ID2','ID3'],columns=['A1','B2','B3'])
df2

           A1        B2        B3
ID1  1.195561  0.503869  0.073529
ID2 -1.209679  0.661429 -0.232032
ID3 -0.018943 -1.559679  0.988838

In [4]:
df.join(df2, lsuffix='_df1', rsuffix='_df2')

,A1_df1,A2,A3,A4,A5,A1_df2,B2,B3
ID1,-0.090358,0.570294,0.562648,-0.212779,0.688481,1.195561,0.503869,0.073529
ID2,0.175455,-1.690947,-0.316585,0.080709,0.397243,-1.209679,0.661429,-0.232032
ID3,0.480168,0.547512,0.897827,-0.630202,1.451062,-0.018943,-1.559679,0.988838
ID4,0.324770,-1.224216,0.525886,1.161081,1.311399,NaN,NaN,NaN
ID5,0.279116,1.434256,-1.241946,0.062798,-0.801436,NaN,NaN,NaN

In [95]:
#only use keys of right join partner
df.join(df2, lsuffix='_df', rsuffix='_df2', how='right')

,A1_df,A2,A3,A4,A5,A1_df2,B2,B3
ID1,1.156511,-1.351960,0.480183,-0.079984,-0.783400,-0.290955,0.060536,-0.836780
ID2,-0.852979,1.812236,-2.584781,-0.926021,0.126254,-0.480798,-0.834332,-0.545343
ID3,1.436398,0.615100,0.384857,-1.891801,-1.595288,1.650879,0.927965,0.878171

In [96]:
df

           A1        A2        A3        A4        A5
ID1  1.156511 -1.351960  0.480183 -0.079984 -0.783400
ID2 -0.852979  1.812236 -2.584781 -0.926021  0.126254
ID3  1.436398  0.615100  0.384857 -1.891801 -1.595288
ID4 -0.016433 -0.148283  1.146154  0.592821  0.002860
ID5  0.374264  1.075948  0.727295 -0.229656  0.225592

# Define your own index

In [97]:
list_2dim = [[100112,"Jim Collins","WI7",4],[120095,"Martin Schrader","WI3",7],[180331,"Achim Zahn","WI7",1],[180332,"Mark Maier","OM3",1]]
#Start with the provided 2dim-list and create a data frame 
df_stud = pd.DataFrame(list_2dim,index=['ID1','ID2','ID3','ID4'],columns=['Matrikel','Name','FoS','Semesters'])
df_stud

     Matrikel             Name  FoS  Semesters
ID1    100112      Jim Collins  WI7          4
ID2    120095  Martin Schrader  WI3          7
ID3    180331       Achim Zahn  WI7          1
ID4    180332       Mark Maier  OM3          1

In [98]:
df_stud=df_stud.set_index('Matrikel')
df_stud

                     Name  FoS  Semesters
Matrikel
100112        Jim Collins  WI7          4
120095    Martin Schrader  WI3          7
180331         Achim Zahn  WI7          1
180332         Mark Maier  OM3          1

# Append a data frame (using concat)

In [99]:
#Append data frame 
#Append data frame to data frame
df_new = pd.DataFrame(randn(2,5),index=['ID6a','ID6b'],columns=df.columns)

#append command is deprecated
#df=df.append(df_new)
df = pd.concat([df, df_new])

df

            A1        A2        A3        A4        A5
ID1   1.156511 -1.351960  0.480183 -0.079984 -0.783400
ID2  -0.852979  1.812236 -2.584781 -0.926021  0.126254
ID3   1.436398  0.615100  0.384857 -1.891801 -1.595288
ID4  -0.016433 -0.148283  1.146154  0.592821  0.002860
ID5   0.374264  1.075948  0.727295 -0.229656  0.225592
ID6a -0.697581 -0.365497  0.624618 -1.334384  0.463019
ID6b -0.397360 -1.472940 -1.062070 -1.081888 -0.964485

In [100]:
#Create a named series object
from numpy.random import rand

ser = pd.Series(rand(5),index=df.columns,name='ID6c')
ser

A1    0.126314
A2    0.624931
A3    0.126795
A4    0.747385
A5    0.131450
Name: ID6c, dtype: float64

In [101]:
#Append named series object to data frame
#df=df.append(ser)
series_df = ser.to_frame().T
df = pd.concat([df, series_df])

df

            A1        A2        A3        A4        A5
ID1   1.156511 -1.351960  0.480183 -0.079984 -0.783400
ID2  -0.852979  1.812236 -2.584781 -0.926021  0.126254
ID3   1.436398  0.615100  0.384857 -1.891801 -1.595288
ID4  -0.016433 -0.148283  1.146154  0.592821  0.002860
ID5   0.374264  1.075948  0.727295 -0.229656  0.225592
ID6a -0.697581 -0.365497  0.624618 -1.334384  0.463019
ID6b -0.397360 -1.472940 -1.062070 -1.081888 -0.964485
ID6c  0.126314  0.624931  0.126795  0.747385  0.131450

In [102]:
#Append dictionary to data frame (without index)
dict_obj = {'A1': 0.1, 'A2': 0.2, 'A3': 0.3, 'A4': 0.4, 'A5': 0.5}
#df=df.append(dict_obj,ignore_index=True)

# Convert the dictionary to a DataFrame
dict_df = pd.DataFrame([dict_obj])

# Concatenate the DataFrame and the dictionary DataFrame vertically
df = pd.concat([df, dict_df])

df

            A1        A2        A3        A4        A5
ID1   1.156511 -1.351960  0.480183 -0.079984 -0.783400
ID2  -0.852979  1.812236 -2.584781 -0.926021  0.126254
ID3   1.436398  0.615100  0.384857 -1.891801 -1.595288
ID4  -0.016433 -0.148283  1.146154  0.592821  0.002860
ID5   0.374264  1.075948  0.727295 -0.229656  0.225592
ID6a -0.697581 -0.365497  0.624618 -1.334384  0.463019
ID6b -0.397360 -1.472940 -1.062070 -1.081888 -0.964485
ID6c  0.126314  0.624931  0.126795  0.747385  0.131450
0     0.100000  0.200000  0.300000  0.400000  0.500000

In [103]:
#Append named dictionary to data frame
dict_obj = {'A1': 0.2, 'A2': 0.4, 'A3': 0.6, 'A4': 0.8, 'A5': 1.0}

# Convert the dictionary to a DataFrame
dict_df = pd.DataFrame([dict_obj],index=['ID7'])

# Concatenate the DataFrame and the dictionary DataFrame vertically
df = pd.concat([df, dict_df])

df

            A1        A2        A3        A4        A5
ID1   1.156511 -1.351960  0.480183 -0.079984 -0.783400
ID2  -0.852979  1.812236 -2.584781 -0.926021  0.126254
ID3   1.436398  0.615100  0.384857 -1.891801 -1.595288
ID4  -0.016433 -0.148283  1.146154  0.592821  0.002860
ID5   0.374264  1.075948  0.727295 -0.229656  0.225592
ID6a -0.697581 -0.365497  0.624618 -1.334384  0.463019
ID6b -0.397360 -1.472940 -1.062070 -1.081888 -0.964485
ID6c  0.126314  0.624931  0.126795  0.747385  0.131450
0     0.100000  0.200000  0.300000  0.400000  0.500000
ID7   0.200000  0.400000  0.600000  0.800000  1.000000

In [104]:
#Append list to data frame
#First try
new_list = [1,2,3,4,5]

# Convert the list to a DataFrame
list_df = pd.DataFrame([new_list])

# Concatenate the DataFrame and the list DataFrame vertically
df_temp = pd.concat([df, list_df])
df_temp

,A1,A2,A3,A4,A5,0,1,2,3,4
ID1,1.156511,-1.351960,0.480183,-0.079984,-0.783400,NaN,NaN,NaN,NaN,NaN
ID2,-0.852979,1.812236,-2.584781,-0.926021,0.126254,NaN,NaN,NaN,NaN,NaN
ID3,1.436398,0.615100,0.384857,-1.891801,-1.595288,NaN,NaN,NaN,NaN,NaN
ID4,-0.016433,-0.148283,1.146154,0.592821,0.002860,NaN,NaN,NaN,NaN,NaN
ID5,0.374264,1.075948,0.727295,-0.229656,0.225592,NaN,NaN,NaN,NaN,NaN
ID6a,-0.697581,-0.365497,0.624618,-1.334384,0.463019,NaN,NaN,NaN,NaN,NaN
ID6b,-0.397360,-1.472940,-1.062070,-1.081888,-0.964485,NaN,NaN,NaN,NaN,NaN
ID6c,0.126314,0.624931,0.126795,0.747385,0.131450,NaN,NaN,NaN,NaN,NaN
0,0.100000,0.200000,0.300000,0.400000,0.500000,NaN,NaN,NaN,NaN,NaN
ID7,0.200000,0.400000,0.600000,0.800000,1.000000,NaN,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,NaN,NaN,1.0,2.0,3.0,4.0,5.0

In [105]:
#Append list to data frame
#Second try
# Convert the list to a DataFrame
list_df = pd.DataFrame([new_list], columns=df.columns)

# Concatenate the DataFrame and the list DataFrame vertically
df = pd.concat([df, list_df])
df

            A1        A2        A3        A4        A5
ID1   1.156511 -1.351960  0.480183 -0.079984 -0.783400
ID2  -0.852979  1.812236 -2.584781 -0.926021  0.126254
ID3   1.436398  0.615100  0.384857 -1.891801 -1.595288
ID4  -0.016433 -0.148283  1.146154  0.592821  0.002860
ID5   0.374264  1.075948  0.727295 -0.229656  0.225592
ID6a -0.697581 -0.365497  0.624618 -1.334384  0.463019
ID6b -0.397360 -1.472940 -1.062070 -1.081888 -0.964485
ID6c  0.126314  0.624931  0.126795  0.747385  0.131450
0     0.100000  0.200000  0.300000  0.400000  0.500000
ID7   0.200000  0.400000  0.600000  0.800000  1.000000
0     1.000000  2.000000  3.000000  4.000000  5.000000